[
    {
      "name":"Rajasthan",
        "image": [
          "https://encrypted-tbn2.gstatic.com/licensed-image?q=tbn:ANd9GcRPT29SL6ep3Op2pzpor1UOn_xFIwqf6yGR69NpR1xmI3P5CLhPOKOYheAcaCi4aOPVDp9om2BWyRtvEAaSV5xp4aCet7DAkd6iur4UEQ",
          "https://encrypted-tbn0.gstatic.com/licensed-image?q=tbn:ANd9GcQeXyWOrlqEOKb7FrJ6gbFX9fr20DB6_GunnKTsNUZZ1SYZ9vHHui-smCHhrG6zn6bThFSuv35In2WelYVXZC5Gy9DdahG5K7sn5CNkGQ",
          "https://encrypted-tbn0.gstatic.com/licensed-image?q=tbn:ANd9GcSJSuqHyzBGW_NSROss9z_caAcrZEocm-SUyto8ikHE_uS2n6_e1iF0gqEn_6toB5pqeoXxWheCkyqJI-DNAkJsxSg73OIXt-U4Whtyrg",
          "https://lh5.googleusercontent.com/p/AF1QipNqsb7mRNcXiB1rp0f-hAkDOXolZWrrxgF72TRJ=w972-h562-n-k-no"
        ],
        "stateMoto": "Padharo Mare Desh",
        "stateSubMoto": "Incredible State of India",
        "HOS": "History of States",
        "HOSImage": "https://mir-s3-cdn-cf.behance.net/projects/404/e778bb195966849.Y3JvcCwxOTkyLDE1NTgsMCwxOQ.jpg",
        "History": "Rajasthan, the largest state in India, was once known as Rajputana and had a pre-historic culture  similar to the Indus Valley civilization. The Chauhans dominated Rajput affairs from the seventh century and became an imperial power by the 12th century. Other prominent states included Marwar, Jaipur, Bundi, Kota, Bharatpur, and Alwar. The British Treaty of Subordinate Alliance in 1818 protected the princes' interests, leaving the people discontented. After the 1857 revolt, the people united under Mahatma Gandhi to contribute to the freedom movement. The introduction of provincial autonomy in 1935 intensified the agitation for civil liberties and political rights in Rajasthan. The States Reorganisation Act (1948) led to the Matsya Union (1948), which merged with other states, eventually becoming the United State of Greater Rajasthan in 1949. In 1958, the present State of Rajasthan was formally formed, with Ajmer state, Abu Road Taluka, and Sunel Tappa joining it. Rajasthan's western flank borders Pakistan,  while Punjab, Haryana, Uttar Pradesh, and Madhya Pradesh border it in north-east, south-east, and south-west",
        "wall": "https://static.vecteezy.com/system/resources/thumbnails/009/875/740/small_2x/seamless-pattern-with-mandala-ornament-ethnic-folk-ornament-vintage-monochrome-damask-ornament-decorative-background-great-for-any-design-free-vector.jpg",
        "Cultures": [
            {
                "txt": "Dal Baati Churma is Rajasthan's most iconic dish, representing the essence of royal Rajasthani cuisine. This traditional meal consists of three components: dal (lentil curry), baati (hard wheat rolls baked in clay ovens), and churma (sweetened wheat flour mixed with ghee and jaggery). The dish originated as a practical meal for warriors who needed nutritious, long-lasting food during battles. Baati could be cooked over cow dung fire in the desert, while dal provided protein and churma offered energy. The preparation involves roasting wheat flour balls until golden, then crushing them and mixing with ghee, sugar, and dry fruits. This hearty meal is typically served during festivals and special occasions, symbolizing Rajasthani hospitality and the state's rich culinary heritage that has been passed down through generations.",
                "image": "https://www.secondrecipe.com/wp-content/uploads/2020/11/dal-bati-churma.jpg"
            },
            {
                "txt": "Ghoomar is Rajasthan's most celebrated folk dance, performed by women during festivals and special occasions. This graceful dance originated in the royal courts of Rajasthan and gets its name from 'ghoomna', meaning to revolve. Dancers wear traditional Rajasthani attire including colorful lehengas with intricate mirror work, heavy jewelry, and veils covering their faces. The dance involves graceful spinning movements where women move in circles, creating mesmerizing patterns with their flowing skirts. Accompanied by traditional folk songs and instruments like dhol, tabla, and harmonium, Ghoomar tells stories of daily life, mythology, and romance. The dance has religious significance too, often performed to honor Goddess Saraswati. UNESCO recognized Ghoomar as an Intangible Cultural Heritage, highlighting its importance in preserving Rajasthani culture and traditions.",
                "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/Ghoomar_dancers_%28Rajasthan%2C_India%2C_2023%29.jpg/1200px-Ghoomar_dancers_%28Rajasthan%2C_India%2C_2023%29.jpg"
            },
            {
                "txt": "Rajasthani folk music forms the soul of the state's cultural identity, characterized by haunting melodies that echo across the Thar Desert. Traditional instruments include the ravanhatha (ancient string instrument), khartal (wooden clappers), morchang (jaw harp), and algoza (double flute). Folk singers called 'Bhopas' and 'Manganiyars' are hereditary musicians who preserve centuries-old ballads and songs. These musical traditions narrate tales of brave Rajput warriors, desert life, love stories, and devotional themes. The music varies across regions - Marwari folk songs differ from Mewari traditions. Instruments like the dhol and shehnai accompany celebrations, while the haunting sound of the ravanhatha tells stories of heroism and romance. This musical heritage has influenced modern Indian cinema and continues to captivate audiences worldwide, representing the timeless spirit of Rajasthan.",
                "image": "https://aathun.com/wp-content/uploads/2021/11/rs1.jpg"
            },
            {
                "txt": "Camel festivals in Rajasthan celebrate the 'Ship of the Desert' that has been integral to the state's culture and economy for centuries. The most famous is the Pushkar Camel Fair, attracting thousands of visitors annually. These festivals showcase beautifully decorated camels adorned with colorful textiles, bells, and ornaments. Events include camel races, dancing camels, camel beauty contests, and traditional camel cart races. The festivals also feature cultural programs with folk music, dance performances, and local handicraft exhibitions. Camel milk and camel rides are popular attractions, while traditional Rajasthani cuisine is served to visitors. These celebrations highlight the historical importance of camels in trade, transportation, and warfare in the desert regions. The festivals preserve ancient traditions while promoting tourism, demonstrating how Rajasthan successfully blends its cultural heritage with modern economic opportunities.",
                "image": "https://currentaffairs.adda247.com/wp-content/uploads/multisite/sites/5/2024/01/13160345/bi.jpg"
            },
            {
                "txt": "Rajasthani textiles represent one of India's most vibrant and intricate textile traditions, known worldwide for their bold colors, mirror work, and detailed embroidery. Traditional techniques include bandhani (tie-dye), block printing, and gota work (gold thread embroidery). Famous textile centers like Jaipur, Jodhpur, and Sanganer have perfected these crafts over centuries. Artisans create stunning lehengas, sarees, dupattas, and wall hangings using natural dyes and traditional motifs inspired by nature, mythology, and royal heritage. The fabrics often feature bright colors like royal blue, deep red, golden yellow, and emerald green, reflecting the desert landscape and royal traditions. Techniques are passed down through generations, with entire families specializing in specific crafts. These textiles are not just clothing but expressions of artistic heritage, worn during festivals, weddings, and cultural celebrations, representing Rajasthan's rich artistic legacy.",
                "image": "https://www.indovacations.net/rajasthan-Tours-Info/Images/Fabrics1.jpg"
            }
        ]
    },
    {
        "name": "Chhattisgarh",
        "image": [
            "https://upload.wikimedia.org/wikipedia/commons/b/b1/Bhoramdeo_Temple%2C_Kawardha.jpg",
            "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Bhoramdeo_Temple_Chhattisgarh.jpg/1024px-Bhoramdeo_Temple_Chhattisgarh.jpg",
            "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Sirpur_Archaeological_Site.jpg/1024px-Sirpur_Archaeological_Site.jpg",
            "https://s7ap1.scene7.com/is/image/incredibleindia/chitrakote-water-falls-jagdalpur-chhattisgarh-1-attr-hero?qlt=82&ts=1727011277081"
        ],
        "stateMoto": "बस्तर का गौरव (Pride of Bastar)",
        "stateSubMoto": "Gateway to Tribal Heartland",
        "HOS": "History & Heritage",
        "HOSImage": "https://upload.wikimedia.org/wikipedia/commons/f/f2/Bhoramdeo_Temple_Chhattisgarh.jpg",
        "History": "Chhattisgarh, carved out of Madhya Pradesh in 2000, has a rich tribal heritage rooted in dynasties like the Maurya and Nagvanshi. The region is celebrated for its ancient rock shelters (Bhimbetka), medieval temples like Bhoramdeo (1089 AD), and archaeological gems at Sirpur dating back to 4th century CE. Chitrakote Falls along the Indravati River, dubbed India's Niagara, has been a sacred site and cultural hub for Bastar's indigenous communities.",
        "wall": "https://static.vecteezy.com/system/resources/thumbnails/009/875/740/small_2x/seamless-pattern-with-mandala-ornament-ethnic-folk-ornament-vintage-monochrome-damask-ornament-decorative-background-great-for-any-design-free-vector.jpg",
        "Cultures": [
            {
                "txt": "Dhokra metalwork represents Chhattisgarh's ancient tribal craftsmanship, dating back over 4,000 years to the Indus Valley Civilization. This lost-wax casting technique creates intricate brass and bronze artifacts including figurines, jewelry, utensils, and decorative items. Tribal artisans, particularly from the Gharua community, have preserved this art form through generations. The process involves creating clay models, covering them with wax, then clay again, and finally pouring molten metal. Each piece is unique, featuring tribal motifs, animals, deities, and geometric patterns that reflect the cultural beliefs of indigenous communities. The craft requires exceptional skill and patience, with a single piece taking weeks to complete. Dhokra items are not just decorative but hold spiritual significance in tribal rituals and ceremonies. Today, this ancient art form supports thousands of tribal families while gaining international recognition as a symbol of India's rich craftsmanship heritage.",
                "image": "https://example.com/dhokra-metalwork.jpg"
            },
            {
                "txt": "Mardi dance is a vibrant cultural expression of the Gond tribe, primarily performed during festivals and harvest celebrations in Chhattisgarh. This energetic folk dance involves both men and women who form circles and dance to rhythmic beats of traditional drums and instruments. Dancers wear colorful tribal costumes adorned with beads, feathers, and traditional jewelry, while their faces are painted with natural colors in geometric patterns. The dance movements mimic various aspects of nature, agricultural activities, and tribal mythology. Songs accompanying the dance narrate stories of tribal heroes, forest deities, and seasonal changes. The Mardi dance serves multiple purposes - entertainment, spiritual connection with nature, and preservation of oral traditions. During performances, the entire community participates, strengthening social bonds and cultural identity. This ancient dance form continues to play a vital role in tribal festivals like Hareli and Pola, maintaining the rich cultural heritage of Chhattisgarh's indigenous communities.",
                "image": "https://example.com/mardi-dance.jpg"
            },
            {
                "txt": "Bastar Dussehra is unique among India's Dussehra celebrations, lasting for 75 days and centered around tribal traditions rather than the typical Ramayana narrative. This festival celebrates the local deity Devi Danteswari and involves the entire tribal community of Bastar region. The celebration begins with the Kachan Gadi ritual and includes elaborate processions, traditional dances, and cultural performances. The highlight is the magnificent chariot procession where the deity's idols are carried through the streets of Jagdalpur. Unlike other Dussehra festivals, Bastar's version emphasizes tribal customs, folk music, and indigenous rituals that have been practiced for centuries. The festival showcases the rich cultural diversity of various tribal communities including Gonds, Marias, and Abhuj Marias. Local artisans create beautiful decorations, tribal musicians perform traditional songs, and the entire region comes alive with cultural activities. This celebration demonstrates how ancient tribal traditions continue to thrive, offering visitors a glimpse into India's diverse cultural landscape.",
                "image": "https://example.com/bastar-dussehra.jpg"
            },
            {
                "txt": "Chhattisgarh's tribal handicrafts represent centuries of indigenous artistry, with each tribe specializing in unique crafts that reflect their cultural identity and connection with nature. The state is renowned for bamboo and cane craft, where artisans create baskets, furniture, decorative items, and musical instruments. Wood carving is another significant craft, producing intricate sculptures, masks, and household items from locally sourced timber. Tribal women excel in creating beautiful textiles using traditional looms, incorporating natural dyes and patterns inspired by forest life. Bell metal craft produces utensils, lamps, and decorative items that are essential in tribal rituals. These handicrafts are not merely commercial products but carry deep cultural significance, often used in ceremonies, festivals, and daily life. The techniques are passed down through generations, with each community maintaining its distinct style and motifs. Government initiatives and craft cooperatives help preserve these traditions while providing sustainable livelihoods to tribal artisans, ensuring the continuity of this rich heritage.",
                "image": "https://example.com/tribal-handicrafts.jpg"
            },
            {
                "txt": "Chhattisgarh's rich folk music traditions echo through its dense forests and tribal villages, representing the voice of indigenous communities who have preserved these melodies for generations. Traditional instruments include the mohuri (wind instrument), timki (small drum), nishaan (large drum), and various string instruments crafted from natural materials. Pandwani is a popular folk singing tradition where skilled performers narrate stories from the Mahabharata using musical storytelling techniques. Tribal communities have their own musical traditions - the Gonds perform ritualistic songs during festivals, while the Baigas have healing songs believed to cure ailments. Folk songs often revolve around themes of nature worship, agricultural cycles, love stories, and heroic tales of tribal leaders. The music serves multiple purposes: entertainment during festivals, spiritual connection during rituals, and preservation of oral history. These musical traditions continue to thrive in rural areas, with young tribal artists learning from elders, ensuring the continuity of Chhattisgarh's invaluable cultural heritage.",
                "image": "https://example.com/folk-music-chhattisgarh.jpg"
            }
        ]
    },
    {
      "name":"Bihar",
        "image": [
          "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/Bodh_Gaya_Mahabodhi_Temple.jpg/1024px-Bodh_Gaya_Mahabodhi_Temple.jpg",
          "https://blissfulbihar.com/wp-content/uploads/2023/08/nalanda-university-ruins.webp",
          "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Patna_Sahib_Gurudwara.jpg/1024px-Patna_Sahib_Gurudwara.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Rajgir_Ancient_City.jpg/1024px-Rajgir_Ancient_City.jpg"
        ],
        "stateMoto": "Satyamev Jayate",
        "stateSubMoto": "Land of Buddha",
        "HOS": "History of States",
        "HOSImage": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Magadha_Empire_Map.jpg/800px-Magadha_Empire_Map.jpg",
        "History": "Bihar, one of India's oldest inhabited regions, holds immense historical significance as the birthplace of Buddhism and Jainism. The ancient kingdom of Magadha, centered in present-day Bihar, was the seat of powerful empires including the Mauryan and Gupta dynasties. The region witnessed the enlightenment of Gautama Buddha at Bodh Gaya and the establishment of Nalanda University, one of the world's first residential universities. The Mauryan emperor Chandragupta Maurya and his grandson Ashoka ruled from Pataliputra (modern Patna), spreading Buddhism across Asia. The Gupta period marked a golden age of Indian culture, arts, and sciences. During medieval times, Bihar came under various Muslim rulers including the Delhi Sultanate and Mughal Empire. The region played a crucial role in India's independence movement with leaders like Dr. Rajendra Prasad, who became India's first President. The Champaran Satyagraha led by Mahatma Gandhi in 1917 marked his first major victory in India. Post-independence, Bihar faced economic challenges but has made significant strides in recent years. The state was bifurcated in 2000 when Jharkhand was carved out, allowing Bihar to focus on its predominantly agricultural economy and rich cultural heritage.",
        "wall": "https://static.vecteezy.com/system/resources/thumbnails/009/875/740/small_2x/seamless-pattern-with-mandala-ornament-ethnic-folk-ornament-vintage-monochrome-damask-ornament-decorative-background-great-for-any-design-free-vector.jpg",
        "Cultures": [
            {
                "txt": "Madhubani painting, also known as Mithila art, is Bihar's most celebrated folk art form that originated in the Mithila region. This ancient art form, traditionally practiced by women, involves creating intricate paintings using natural pigments and dyes on walls, floors, and handmade paper. The paintings typically depict Hindu mythological scenes, nature motifs, and social events like marriages and festivals. Traditional themes include stories of Lord Krishna, Rama, Durga, and other deities, along with peacocks, fish, elephants, and geometric patterns. Artists use natural materials like rice paste, turmeric, indigo, and charcoal to create vibrant colors. The art form has three distinct styles: Bharni (filled with bright colors), Kachni (line drawings), and Tantrik (spiritual themes). UNESCO recognized Madhubani as a Masterpiece of Oral and Intangible Heritage of Humanity. Today, this traditional art has evolved from rural walls to international galleries, providing livelihood to thousands of women artists while preserving Bihar's rich cultural heritage.",
                "image": "https://example.com/madhubani-painting.jpg"
            },
            {
                "txt": "Chhath Puja is Bihar's most significant festival, dedicated to the Sun God (Surya) and his consort Chhathi Mata. This ancient Vedic festival, celebrated with unmatched devotion, spans four days and involves rigorous rituals including fasting, holy bathing, and standing in water bodies for hours. Devotees, primarily women called 'Vratis', observe strict fasting for 36 hours without water, preparing traditional offerings like thekua, kheer, and fruits in bamboo baskets called 'daura'. The festival's highlight occurs at river banks, ponds, or other water bodies where devotees stand waist-deep in water, offering prayers to the setting and rising sun. The ritualistic songs, called Chhath geet, create a spiritual atmosphere as hundreds of devotees gather together. This festival transcends religious boundaries, with people from all communities participating. The celebration emphasizes environmental consciousness, family unity, and gratitude to nature. Chhath Puja has gained recognition beyond Bihar, celebrated by the diaspora worldwide, making it a symbol of Bihari cultural identity and devotion.",
                "image": "https://example.com/chhath-puja.jpg"
            },
            {
                "txt": "Bihari folk music represents the cultural heartbeat of the state, encompassing various regional traditions that reflect the lives, struggles, and celebrations of common people. Sohar songs are sung during childbirth, welcoming new life with melodious tunes that express joy and hope. Kajri and Jhumar are popular during the monsoon season, celebrating love and nature's beauty. Biraha is a unique musical storytelling tradition where singers narrate tales of love, separation, and social issues through powerful vocals and dramatic expressions. Traditional instruments include the dhol, tabla, harmonium, sarangi, and manjira, creating rhythmic accompaniments to these folk songs. Regional variations exist across Bihar - Bhojpuri songs differ from Maithili traditions, each reflecting local dialects and cultural nuances. These songs serve multiple purposes: entertainment during festivals, cultural preservation, and social commentary. Many contemporary Bollywood songs have roots in Bihari folk music, demonstrating its enduring influence on Indian music. The tradition continues through local artists and cultural programs, maintaining Bihar's rich musical heritage.",
                "image": "https://example.com/bihari-folk-music.jpg"
            },
            {
                "txt": "Bihar's Buddhist heritage represents one of the world's most significant spiritual legacies, centered around Bodh Gaya where Gautama Buddha attained enlightenment under the Bodhi tree. The Mahabodhi Temple, a UNESCO World Heritage site, attracts millions of pilgrims and tourists annually. The state houses numerous Buddhist sites including Nalanda University ruins, once the world's first residential university attracting scholars from across Asia. Rajgir, where Buddha delivered many important sermons, contains ancient monasteries and meditation caves. Vaishali, birthplace of Lord Mahavira and site of Buddha's last sermon, showcases stupas and archaeological remains. These sites feature magnificent stupas, monasteries, sculptures, and meditation halls that reflect the artistic and architectural achievements of ancient India. The Buddhist heritage includes not just monuments but living traditions - meditation practices, philosophical teachings, and cultural festivals. Today, Bihar's Buddhist circuit is promoted as a major pilgrimage and tourist destination, connecting devotees worldwide with the origins of Buddhism while contributing to the state's economic development through heritage tourism.",
                "image": "https://example.com/buddhist-heritage.jpg"
            },
            {
                "txt": "Bihar's traditional crafts represent centuries of skilled artisanship, with each region specializing in unique handicrafts that reflect local culture and resources. Sikki grass craft, primarily from Madhubani district, involves creating baskets, decorative items, and toys using golden sikki grass. Artisans weave intricate patterns and designs that often complement Madhubani paintings. Bhagalpur is famous for Tussar silk production, known as 'Bihar silk', where silkworms are reared on arjun and asan trees. The silk fabrics are renowned for their natural golden color and durability. Stone carving traditions continue in areas around Gaya and Rajgir, producing sculptures and architectural elements for temples and monuments. Bamboo craft thrives in various districts, creating household items, furniture, and decorative pieces. Pottery traditions are particularly strong in rural areas, producing earthenware for daily use and decorative purposes. These crafts provide livelihoods to thousands of families while preserving traditional skills passed down through generations. Government initiatives and NGOs work to modernize these crafts and connect artisans with wider markets, ensuring economic viability while maintaining cultural authenticity.",
                "image": "https://example.com/bihar-traditional-crafts.jpg"
            }
        ]
    },
    {
        "name":"TamilNadu",
        "image": [
        "https://encrypted-tbn3.gstatic.com/licensed-image?q=tbn:ANd9GcTb2K9VlHO5lWVzMnj6G6E9cmP01QQL45jt0oVW3zhF-MXTteJ4S_BXFBZ6WWcqcrcbRbT-L4Zm-jblfXf1gDMhwPJ6pl7AsF7ZVL0syw",
        "https://lh5.googleusercontent.com/p/AF1QipPqhp_nLJl4CaAt8S-T-vb0xfQZO9OIcRjVLSHS=w972-h562-n-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOn9MjC_dOPx6yNArXy2OJiaNB-W0ER5QQ-eR6_=w972-h562-n-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOe0EVXkHRA-Kge8AgDBPH2p2t6KTNV86WVCOS7=w972-h562-n-k-no"
        ],
        "stateMoto": "Truth Alone Triumphs",
        "stateSubMoto": "The Land of Temples",
        "HOS": "History of States",
        "HOSImage": "https://upload.wikimedia.org/wikipedia/commons/7/78/TamilNadu_History_Map.jpg",
        "History": " Tamil Nadu, located in southeast India, has a rich history dating back to 15,000 BCE to 10,000 BCE. The region has been inhabited by three ancient Tamil dynasties, Chera, Chola, and Pandya, who ruled with unique culture and language. The Kalabhras invaded the region in the 3rd century, displacing the three ruling kingdoms.The Pandyas and Pallavas later restored the traditional kingdoms. The Cholas, who re-emerged in the 9th century, expanded their empire over the southern peninsula, spanning almost 3,600,000 km². The Chola navy held power over the Sri Vijaya kingdom in Southeast Asia.Rapid political changes in India occurred due to Muslim incursions and the decline of the ancient dynasties.The Vijayanagara Empire gained a foothold in the region from the late 14th century until the 16th century.The Maratha Empire expanded its territories into present-day Tamil Nadu.",
        "wall": "https://static.vecteezy.com/system/resources/thumbnails/009/875/740/small_2x/seamless-pattern-with-mandala-ornament-ethnic-folk-ornament-vintage-monochrome-damask-ornament-decorative-background-great-for-any-design-free-vector.jpg",
        "Cultures": [
      {
        "txt": "Bharatanatyam, Tamil Nadu's classical dance form, represents the pinnacle of Indian performing arts with its origins tracing back over 2000 years to temple traditions. This sacred dance combines intricate footwork, expressive hand gestures (mudras), facial expressions (abhinaya), and rhythmic movements to narrate stories from Hindu epics and mythology. Dancers undergo rigorous training for years to master the complex techniques, learning precise positions, steps, and emotional expressions. The dance is characterized by its geometric precision, with dancers creating triangular shapes and symmetrical patterns through their body positions. Traditional performances include items like Alarippu, Jatiswaram, Shabdam, Varnam, and Thillana, each serving different purposes in storytelling and spiritual expression. The elaborate costumes feature silk sarees, temple jewelry, intricate makeup, and jasmine flowers, transforming dancers into divine beings. Bharatanatyam was revived during the independence movement as a symbol of cultural pride and continues to be performed worldwide. Contemporary choreographers blend traditional elements with modern themes, ensuring this ancient art form remains relevant while preserving its spiritual essence and technical rigor.",
        "image": "https://example.com/bharatanatyam-classical-dancer.jpg"
      },
      {
        "txt": "Tamil literature stands as one of the world's oldest literary traditions, with works dating back over 2000 years that continue to influence modern thought and culture. The Sangam literature, composed between 300 BCE and 300 CE, includes masterpieces like Thirukkural by Thiruvalluvar, containing 1330 couplets on ethics, politics, and love that remain relevant today. Epic works like Silappatikaram and Manimekalai showcase Tamil narrative poetry at its finest, weaving together love stories, moral lessons, and cultural insights. The medieval period produced devotional literature through Nayanars and Alvars, whose hymns form the foundation of Tamil spirituality. Modern Tamil literature has produced renowned authors like Bharathiyar, Kalki, and Jayakanthan who addressed social issues and human emotions with profound sensitivity. The language itself is celebrated for its rich vocabulary, grammatical sophistication, and poetic beauty. Today, Tamil literature encompasses diverse genres from historical fiction to contemporary poetry, with works being translated globally. Literary festivals and cultural organizations continue to promote Tamil literary heritage, ensuring this ancient tradition thrives in the digital age while maintaining its linguistic purity and cultural significance.",
        "image": "https://example.com/tamil-literature-manuscripts.jpg"
      },
      {
        "txt": "Tamil Nadu's temple architecture represents the zenith of Dravidian architectural achievement, with magnificent temples that serve as centers of spirituality, art, and community life. The iconic gopurams (temple towers) rise majestically skyward, adorned with thousands of colorful sculptures depicting gods, goddesses, and mythological scenes. Famous temples like Meenakshi Temple in Madurai, Brihadeeswarar Temple in Thanjavur, and Nataraja Temple in Chidambaram showcase different periods of architectural evolution spanning over a millennium. These structures feature intricate stone carvings, mandapams (halls), sacred tanks, and elaborate pillared corridors that create spiritual atmospheres. The bronze sculptures of Chola period temples, particularly the Nataraja (Dancing Shiva), are considered masterpieces of world art. Temple festivals bring these monuments to life with processions, music, dance, and elaborate decorations. The architectural principles emphasize harmony, proportion, and spiritual symbolism, with every element serving both aesthetic and religious purposes. Modern temple construction continues these traditions while incorporating contemporary needs. These temples are not just religious sites but living museums that preserve Tamil culture, providing space for classical arts, festivals, and community gatherings that maintain Tamil Nadu's rich spiritual heritage.",
        "image": "https://example.com/tamil-nadu-temple-gopuram.jpg"
      },
      {
        "txt": "Tamil cuisine reflects the state's diverse geography, climate, and cultural influences, offering a rich tapestry of flavors that celebrate both vegetarian and non-vegetarian traditions. The foundation lies in rice, which is prepared in countless ways - from simple steamed rice to elaborate biryanis and flavorful varieties like coconut rice, lemon rice, and curd rice. Traditional meals are served on banana leaves, creating an eco-friendly and aromatic dining experience. South Indian breakfast items like idli, dosa, vada, and pongal have gained international recognition for their nutritional value and unique preparation methods. The famous sambar and rasam provide the liquid base for meals, combining lentils with vegetables and spices in perfect harmony. Regional specialties include Chettinad cuisine known for its fiery spices, Kongu cuisine featuring unique preparations, and coastal varieties emphasizing seafood and coconut. Traditional sweets like Mysore pak, adhirasam, and payasam mark celebrations and festivals. The extensive use of curry leaves, tamarind, coconut, and indigenous spices creates distinctive flavors. Modern Tamil cuisine has evolved to include fusion dishes while maintaining traditional cooking methods and emphasizing fresh, local ingredients that promote health and sustainability.",
        "image": "https://example.com/tamil-nadu-traditional-meal.jpg"
      },
      {
        "txt": "Tamil folk arts encompass a vibrant collection of traditional performances that preserve the state's cultural narratives and community bonds through generations. Karagattam, a folk dance balancing decorated pots, combines acrobatics with storytelling, often performed during temple festivals and community celebrations. Oyilattam involves rhythmic dancing with colorful handkerchiefs, creating mesmerizing patterns while narrating folk tales. Devarattam, performed with wooden sticks, showcases warrior traditions and requires precise coordination among performers. Puppet shows using traditional string puppets tell stories from epics and local legends, entertaining audiences while preserving oral traditions. Folk music includes various regional forms like Oppari (lamentation songs), Kummi (circle dances), and work songs that accompany agricultural activities. These art forms serve multiple purposes: entertainment, cultural preservation, social commentary, and community bonding. Instruments like nadaswaram, thavil, and various percussion instruments provide musical accompaniment. Many folk artists come from hereditary performer communities who have maintained these traditions despite modern challenges. Government initiatives and cultural organizations work to document, preserve, and promote these art forms through festivals, workshops, and educational programs, ensuring their survival for future generations while adapting to contemporary contexts.",
        "image": "https://example.com/tamil-folk-karagattam-dance.jpg"
      }
    ]
      },
    {
      "name":"Punjab",
        "image": [
          "https://upload.wikimedia.org/wikipedia/commons/9/94/Golden_Temple%2C_Amritsar.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/f/f7/Baisakhi_Festival.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/1/1e/Punjabi_Folk_Dance_-_Bhangra.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/f/f5/Wagah_Border_Ceremony.jpg"
        ],
        "stateMoto": "Work is Worship",
        "stateSubMoto": "Land of Five Rivers",
        "HOS": "History of States",
        "HOSImage": "https://www.mapsofindia.com/maps/punjab/punjab-history.jpg",
        "History": "Punjab, cradle of the Indus Valley Civilization, has a rich Sikh heritage. It was a major site for the freedom struggle and partition. Post-independence, it was reorganized in 1966 into a primarily Punjabi-speaking state. It remains culturally vibrant and agriculturally prosperous.",
        "wall": "https://img.freepik.com/premium-vector/punjabi-culture-seamless-pattern_102902-71.jpg",
             "Cultures": [
        {
          "txt": "Bhangra, a high‑energy folk dance originally from the Punjab region, marks harvest celebrations with vigorous leaps, kicks and drum rhythms (dhol). Dancers wear colorful attire with turbans and sashes. It’s now a global cultural symbol of Punjabi pride.",
          "image": "https://example.com/punjab-bhangra.jpg"
        },
        {
          "txt": "Giddha is the complementary folk dance performed by Punjabi women, characterized by graceful hand gestures (boliyan) and rhythmic claps, performing around a central ring while singing playful folk couplets.",
          "image": "https://example.com/giddha-punjab.jpg"
        },
        {
          "txt": "Punjabi folk music uses instruments like tumbi, algoza, chimta and dholak. Dhadi balladeers sing heroic tales at village melas—celebrating valor, history and community unity.",
          "image": "https://example.com/punjab-folk-music.jpg"
        },
        {
          "txt": "Punjabi cuisine is famous for its rich, buttery texture and robust flavors—think makki di roti with sarson da saag, butter chicken, chole bhature, lassi, and jalebi. It reflects a hearty agrarian lifestyle.",
          "image": "https://example.com/punjab-cuisine.jpg"
        },
        {
          "txt": "Punjabi literature includes medieval Sufi poetry (Bulleh Shah, Waris Shah) and modern writers like Amrita Pritam. These works explore love, social justice and spirituality in rhythmic, folk‑accessible language.",
          "image": "https://example.com/punjabi-literature.jpg"
        }
      ]
    },
    {
      "name":"WestBengal",
        "image": [
          "https://upload.wikimedia.org/wikipedia/commons/4/47/Victoria_Memorial_Kolkata.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/4/4f/Kolkata_Howrah_Bridge.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/0/00/Durga_Puja_Kolkata.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/2/2c/Darjeeling_Tea_Garden.jpg"
        ],
        "stateMoto": "Unity in Diversity",
        "stateSubMoto": "Cultural Capital of India",
        "HOS": "History of States",
        "HOSImage": "https://upload.wikimedia.org/wikipedia/commons/d/d9/Map_of_Bengal%2C_1907.jpg",
        "History": "West Bengal was at the forefront of the Bengal Renaissance and India's independence movement. It was partitioned in 1947, separating it from East Pakistan (now Bangladesh). Known for its literature, arts, and political activism, the state was reorganized post-independence with Kolkata as its capital.",
        "wall": "https://static.vecteezy.com/system/resources/thumbnails/005/280/161/small_2x/indian-motif-seamless-pattern-free-vector.jpg",
             "Cultures": [
        {
          "txt": "Rabindra Sangeet, the poetic songs of Rabindranath Tagore, blend classical Indian ragas with folk and western influences; they explore love, nature, devotion and modern life and are integral to Bengali identity.",
          "image": "https://example.com/rabindra-sangeet.jpg"
        },
        {
          "txt": "Durga Puja is Bengal’s grandest religious festival, celebrating Goddess Durga’s triumph over evil. Elaborately sculpted idols, thematic pandals, cultural performances and bhog (feast) bring entire communities together.",
          "image": "https://example.com/durga-puja.jpg"
        },
        {
          "txt": "Bengali sweets like rasgulla, sandesh, mishti doi and chomchom are world‑famous for their delicate textures and sugar‑balanced flavors. Mithai shops are cultural icons in every locality.",
          "image": "https://example.com/bengali-sweets.jpg"
        },
        {
          "txt": "Bengali literature, from the medieval mystic Chaitanya poets to modern novelists like Sarat Chandra Chattopadhyay, Tagore, and Satyajit Ray, uses music, social realism and political commentary.",
          "image": "https://example.com/bengali-literature.jpg"
        },
        {
          "txt": "Bengali cinema, from Satyajit Ray’s humanistic masterpieces to contemporary arthouse films, reflects social dilemmas and cultural depth. Jatra (open‑air folk theatre) remains a vibrant rural performance tradition.",
          "image": "https://example.com/bengali-cinema-jatra.jpg"
        }
      ]
    },
     {
      "name":"Gujarat",
        "image": [
          "https://encrypted-tbn2.gstatic.com/licensed-image?q=tbn:ANd9GcT4XmOVcsKhHFOIRtzy5ecI8qeooLajAcHIc5zt9_nMmuomBEgbinBcIlWmqNV4Ah4cYDbePzdvBdaRUrjmIb2_9Qh5NxL1Bl0gP6xrLg",
          "https://lh3.googleusercontent.com/gps-cs-s/AC9h4noZByB964OC1_on3L6C5Z67Kgvhwa0bF8Z0LO2jFVJT2onifUHk6vCRi4gOG_MpTc7ivyZyuzobVLBpQX-JaC4Kp_cchCEXUIycum8dngcElpmubhrRFA7lrwetVW0UuHdpuzcq=w875-h505-n-k-no",
          "https://lh3.googleusercontent.com/gps-cs-s/AC9h4np5eFqrukCnVW4WIfUzQdJZFmS1iqLX-_9VLWpANOT-QGMSdWgDcutCs05ZgHKRxTltMIREkcv6Q_kP79Jfi0E6Ed9F8nwtUt7sAacNGi5XvScSPUBAJUllX2bm4ZTXdfUjmIef=w875-h505-n-k-no",
          "https://encrypted-tbn2.gstatic.com/licensed-image?q=tbn:ANd9GcQ_bFPQS4nvPas6a9RB23aIKhGwE2mc3sdOrWIctw_Oa98cGhAs12R4OYc41QhXJiGG8y0Pp714x-9WXKr9AD3j3owSH5j-3YNrc0zrKA"
        ],
        "stateMoto": "Jewel of Western India",
        "stateSubMoto": "Vibrant Gujarat",
        "HOS": "History of States",
        "HOSImage": "https://media.craftyartapp.com/uploadedFiles/thumb_file/4d058645ddaf4366249939b8af4563f5b274a4c21745925090.jpg",
        "History": "Gujarat has a history tracing back to the Harappan civilization. It saw the rise of the Mauryas, Guptas, and later the Solanki dynasty. It was a key region for maritime trade. Post-independence, Gujarat became a state on May 1, 1960, formed by separating Marathi-speaking and Gujarati-speaking areas from the former Bombay State.It's the fifth-largest Indian state by area and the ninth-most populous state.The state's geographic diversity includes the longest coastline in India (approx. 1,600 km), most of which lies on the Kathiawar peninsula, bordering the Arabian Sea to the west. It also shares borders with Pakistan, Rajasthan, Madhya Pradesh, and Maharashtra",
        "wall": "https://static.vecteezy.com/system/resources/thumbnails/009/875/740/small_2x/seamless-pattern-with-mandala-ornament-ethnic-folk-ornament-vintage-monochrome-damask-ornament-decorative-background-great-for-any-design-free-vector.jpg",
              "Cultures": [
        {
          "txt": "Garba and Dandiya Raas are energetic circle dances performed during Navratri, featuring rhythmic steps, twirls, sticks (dandiya) and prayerful songs honoring the Goddess.",
          "image": "https://travel-blog.happyeasygo.com/wp-content/uploads/2024/10/Garba-Vadodra.png"
        },
        {
          "txt": "Gujarati cuisine balances sweet, salty and spicy flavors—dishes like dhokla, thepla, khandvi and undhiyu showcase gram‑flour, yogurt, peanuts and seasonal vegetables; snacks and farsan are world‑famous.",
          "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRZht0EyS1XSJ2CYV00qliuRUcTS7DWAkw-OA&s"
        },
        {
          "txt": "Kutchi embroidery and bandhani tie‑dye textiles feature vivid patterns made with mirror‑work and resist dyeing; they are central to traditional dress and regional artisan markets.",
          "image": "https://mediaindia.eu/wp-content/uploads/2016/12/3F5A8449.jpg"
        },
        {
          "txt": "Gujarati folk music includes Dayro gatherings—story‑telling musical poetry; trance‑like devotional songs (Garbi), and Bhavai folk theatre that blends humour and social messages.",
          "image": "https://www.gujaratexpert.com/blog/wp-content/uploads/2019/01/Gujarat-Music.jpg"
        },
        {
          "txt": "Jain architecture in Gujarat includes exquisitely carved temples like Palitana and Mount Abu shrines—symmetrical marble carvings, ornate domes and spiritual halls showcase unparalleled craftsmanship.",
          "image": "https://www.gujaratexpert.com/blog/wp-content/uploads/2018/03/Palitana-Temples-Bhavnagar.jpg"
        }
      ]
    },
    {
      "name":"Kerala",
        "image": [
        "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSYrRRbKv7V5wxI9HeywAnYR5NA-Gku19ak1Q&s",
        "https://www.keralatourism.org/images/microsites/bekal/history-kasaragod.jpg",
        "https://www.keralatourism.org/images/microsites/bekal/history-kasaragod.jpg",
        "https://keralahouse.kerala.gov.in/storage/images/135.jpg"
        ],
        "stateMoto": "God's Own Country",
        "stateSubMoto": "Land of Coconut and Backwaters",
        "HOS": "History of States",
        "HOSImage": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Travancore_Map_1815.jpg",
        "History": "Kerala's history includes the Chera kingdom and later colonial periods under the Portuguese, Dutch, and British. It was formed in 1956 by merging Malabar, Travancore, and Cochin regions. Kerala is known for its literacy, healthcare, and unique matrilineal traditions.",
        "wall": "https://static.vecteezy.com/system/resources/thumbnails/009/351/997/small_2x/hand-drawn-tropical-leaves-seamless-pattern-background-free-vector.jpg",
              "Cultures": [
        {
          "txt": "Kathakali, with its elaborate face‑paint, headgear and slow‑motion storytelling, dramatizes Hindu epics through expressive gestures and eye movements backed by classical percussion.",
          "image": "https://example.com/kathakali.jpg"
        },
        {
          "txt": "Mohiniyattam is a graceful solo dance form performed by women, blending poetic expression and feminine elegance, often themed around devotion and love.",
          "image": "https://example.com/mohiniyattam.jpg"
        },
        {
          "txt": "Ayurveda, the traditional system of medicine, thrives in Kerala’s numerous wellness retreats offering herbal oil massages, holistic therapies and rejuvenation rituals drawn from ancient texts.",
          "image": "https://example.com/kerala-ayurveda.jpg"
        },
        {
          "txt": "Onam, the state’s major festival, celebrates King Mahabali’s mythical homecoming. It includes pookkalam (flower carpets), boat races (vallam kali), Onasadya feast on banana leaves, and folk dances.",
          "image": "https://example.com/kerala-onam.jpg"
        },
        {
          "txt": "Coconut‑based cuisine—like appam, puttu, fish moilee and keralan stew—is flavored with coconut oil, fresh spices and curry leaves. Traditional toddy, banana chips and seafood mark cuisine diversity.",
          "image": "https://example.com/kerala-cuisine.jpg"
        }
      ]
    },
    {
      "name":"Maharashtra",
        "image": [
          "https://imgs.search.brave.com/VVipt3pwPDQJ-RR5t6OXBwwQ8tRGjiRw_TeHu9j_wB8/rs:fit:860:0:0:0/g:ce/aHR0cHM6Ly93d3cu/Z29kaWdpdC5jb20v/Y29udGVudC9kYW0v/Z29kaWdpdC9kaXJl/Y3Rwb3J0YWwvZW4v/Y29udGVudGhtL3Rv/dXJpc3QtcGxhY2Vz/LW1haGFyYXNodHJh/LmpwZw",
          "https://imgs.search.brave.com/SEfjXsohkwNdY7qFe2kJzkMEr8DtmWrbk4U_TPb3WsU/rs:fit:860:0:0:0/g:ce/aHR0cHM6Ly90aGV3/YW5kZXJ0aGVyYXB5/LmNvbS93cC1jb250/ZW50L3VwbG9hZHMv/MjAyNC8wNi8yLnBs/YWNlcy10by12aXNp/dC1pbi1tYWhhcmFz/aHRyYS5qcGc",
          "https://imgs.search.brave.com/E2OkaLZ82BMtRcUAdfE17XKdXJyCkdnoGJMHofbFYOA/rs:fit:860:0:0:0/g:ce/aHR0cHM6Ly9nb21h/ZG5vbWFkLmNvbS93/cC1jb250ZW50L3Vw/bG9hZHMvMjAyNC8w/My9zYWNoaW4tdGFu/ZGFsZS1RUWxXSGVo/STB0cy11bnNwbGFz/aC01Njh4MTAyNC5q/cGc",
          "https://imgs.search.brave.com/s4tCnmelkIoYdIGfn9vdjdS3kOw8scQDUyyRglJV6HM/rs:fit:860:0:0:0/g:ce/aHR0cHM6Ly9oYmxp/bWcubW10Y2RuLmNv/bS9jb250ZW50L2h1/YmJsZS9pbWcvbmFz/aWsvbW10L2Rlc3Rp/bmF0aW9uL3RfdHJw/L21fTmFzaGlrMV9k/ZXN0aW5hdGlvbl9s/XzUzNV84MDIuanBn/P2ltPVJlc2l6ZT0o/NDgwLDQ4MCk"
        ],
        "stateMoto": "Strength and Progress",
        "stateSubMoto": "Land of Marathas",
        "HOS": "History of States",
        "HOSImage": "https://upload.wikimedia.org/wikipedia/commons/c/ca/British_Bombay_Presidency_1909.jpg",
        "History": "Maharashtra has been home to the Maratha Empire led by Shivaji. It played a crucial role in the British era as Bombay Presidency. After independence, the state was formed in 1960 with Mumbai as its capital. It remains an economic powerhouse and cultural hub.",
        "wall": "https://cdn.pixabay.com/photo/2017/02/01/10/39/pattern-2025610_960_720.png",
         "Cultures": [
        {
          "txt": "Lavani is a fast‑paced folk dance combining traditional Marathi music and storytelling through powerful song and rhythmic footwork; performers wear striking nine‑yard sarees and silver jewellery.",
          "image": "https://example.com/lavani.jpg"
        },
        {
          "txt": "Ganesh Chaturthi sees Maharashtra’s streets alive with elaborately crafted Ganesha idols, processions of chanting devotees, dhol‑tasha drummers, visarjan immersions, and community feasts.",
          "image": "https://example.com/ganesh-festival.jpg"
        },
        {
          "txt": "Marathi literature includes saint‑poets like Tukaram and Dnyaneshwar (abhang devotional poetry), alongside modern novelists like P. L. Deshpande and V. P. Kale addressing social issues with wit.",
          "image": "https://example.com/marathi-literature.jpg"
        },
        {
          "txt": "Historic hill‑forts and Marathi folk theatre—like Tamasha and Gondhal—feature folk song‑dance drama, humour and social commentary, often staged in rural gatherings.",
          "image": "https://example.com/tamasha.jpg"
        },
        {
          "txt": "Street‑food favourites like vada pav, misal pav, and poha reflect Maharashtra’s urban pulse. Traditional sweets such as puran poli, modak, and shrikhand hold religious and seasonal significance.",
          "image": "https://example.com/maharashtra-cuisine.jpg"
        }
      ]
    },
     {
      "name":"Karnataka",
        "image": [
          "https://lh3.googleusercontent.com/gps-cs-s/AC9h4nrwksGY7mpRRFlhoA6bzBLzULklPj-26ttKxDcvZoWGzyuDD6IrlaBXjylS2hQX3ZUXm6OGXdnv-dRQ998aGIqgz3rYGv8kd42mz65C6cWc1kr3wW6Tojr1WwLMQVj8oruRnTN_PA=w875-h505-n-k-no",
          "https://lh3.googleusercontent.com/gps-cs-s/AC9h4nqqBDlsH93xzoWdxcfQR4_ICArNGHv_GU-YMPCar_cuVaNywYlJ_zn-kYYtxOj4wb912RMR6zJkpeofB-sOlHLoi-9jrt-sx6bQULnkjBZOqT-4TH3xz_5V3bhvFaoEu51nPCA=w875-h505-n-k-no",
          "https://lh3.googleusercontent.com/gps-cs-s/AC9h4nqv11HoEeEey0Ngdv3JKhnDfo-MDxjKnMuzi5WQa7WOUpR3uH-muNINgo0OPvSBrsKRdi5zANhE4l3Q1V-ZUHQCDKrI7YUR3iwopkzpWORG6IODsRSHOWWUadM-aNStLTJKFCB-=w875-h505-n-k-no",
          "https://encrypted-tbn2.gstatic.com/licensed-image?q=tbn:ANd9GcSAFPyJTl-ZPPf31Zrbqgb7pWTjBYasVApaNHMld949OMGLZCev342epX7C0H-3d2c3d9gdJBRfuOmab_a52_MllWFjV2odgQ-dYZGjyA"
        ],
        "stateMoto": "One State, Many Worlds",
        "stateSubMoto": "Silicon Valley of India",
        "HOS": "History of States",
        "HOSImage": "https://s3.ap-south-1.amazonaws.com/media.thesouthfirst.com/wp-content/uploads/2025/03/A-map-of-Karnataka.jpg",
        "History": "Karnataka has a rich history spanning over two millennia, with various empires and dynasties having ruled the region, including the Nanda Empire, Mauryan Empire, Kadamba Dynasty, and Chalukya Dynasty. The state is a hub of cultural heritage, home to classical dance forms such as Bharatanatyam and Yakshagana, according to Invest Karnataka. The state is also the birthplace of Carnatic music. Karnataka celebrates various festivals, including Ugadi, marking the beginning of the year, Makar Sankranti, Diwali, and the Pattadakal Dance festival.Karnataka is also home to the world's largest monolithic statue, the 58-foot tall statue of Gommateshwara at Shravanbelagola.",
        "wall": "https://img.freepik.com/free-vector/seamless-mandala-pattern_1048-13104.jpg",
              "Cultures": [
        {
          "txt": "Carnatic music—classical south Indian music—is deeply rooted in Karnataka, with composers like Purandara Dasa (‘Father of Carnatic Music’) and Karnataka Sangeetha tradition centered around vocal recital and instrumental accompaniment.",
          "image": "https://mumbaimirror.indiatimes.com/thumb/msid-55826851,width-1200,height-900,resizemode-4/.jpg"
        },
        {
          "txt": "Yakshagana is a vibrant folk theatre combining dance, dialogue, music and elaborate costumes to narrate stories from epics like Mahabharata in coastal and central Karnataka.",
          "image": "https://example.com/yakshagana.jpg"
        },
        {
          "txt": "Sandalwood craftsmanship is renowned—Karnataka produces fragrant sandalwood used in carvings, incense, and sculptures, preserving an artisanal legacy of temples and decorative arts.",
          "image": "https://example.com/sandalwood-craft.jpg"
        },
        {
          "txt": "Mysore Dasara is the state festival commemorating Goddess Chamundeshwari, featuring royal processions, elephant pageantry, torchlight parade, and cultural performances in Mysuru.",
          "image": "https://example.com/mysore-dasara.jpg"
        },
        {
          "txt": "Cuisine like Bisi Bele Bath (spiced rice‑lentil dish) and Ragi Mudde (finger millet balls)—nutritious, earthy staples—reflect local agriculture, served with sambar, chutneys, or saaru.",
          "image": "https://example.com/karnataka-cuisine.jpg"
        }
      ]
    },
    {
      "name":"UttarPradesh",
        "image": [
          "https://upload.wikimedia.org/wikipedia/commons/d/da/Taj-Mahal.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/1/15/Kashi_Viswanath_Temple.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/1/1e/Holika_Dahan_in_Uttar_Pradesh.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/f/f9/Bara_Imambara_Lucknow.jpg"
        ],
        "stateMoto": "Sarvajan Hitay, Sarvajan Sukhay",
        "stateSubMoto": "The Heartland of India",
        "HOS": "History of States",
        "HOSImage": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Map_of_British_India%2C_1909%2C_Uttar_Pradesh.jpg",
        "History": "Uttar Pradesh, home to ancient cities like Varanasi and Ayodhya, has deep roots in Hindu mythology and Indian history. It played a major role in the Revolt of 1857 and the Indian independence movement. Created in 1950 from the United Provinces, it is India's most populous state.",
        "wall": "https://static.vecteezy.com/system/resources/thumbnails/007/967/260/small_2x/indian-traditional-seamless-pattern-design-free-vector.jpg",
        "Cultures": [
        {
          "txt": "Kathak, one of the eight major Indian classical dance forms, traces its origins to Uttar Pradesh—with intricate footwork and expressive storytelling passed down through Lucknow and Jaipur Gharanas.",
          "image": "https://example.com/kathak-up.jpg"
        },
        {
          "txt": "Ramleela, theatrical enactment of the Ramayana, draws massive audiences across UP in the lead‑up to Dussehra—culminating in effigy burning symbolizing Ravana’s defeat.",
          "image": "https://example.com/ramleela.jpg"
        },
        {
          "txt": "Urdu poetry, especially ghazals and shayari, thrives in cities like Lucknow and Varanasi—celebrated in mushairas with poets like Mir and contemporary stars.",
          "image": "https://example.com/urdu-poetry.jpg"
        },
        {
          "txt": "Ganga Aarti, the devotional evening ritual on Varanasi’s riverfronts, uses incense, fire lamps and hymns—creating a spiritual spectacle that attracts pilgrims worldwide.",
          "image": "https://example.com/ganga-aarti.jpg"
        },
        {
          "txt": "Mughlai cuisine (e.g., Tunday Kebab, Galouti), rich in aroma and texture, blends Central Asian and local traditions—served in narrow lanes of Lucknow and historic dishes across the state.",
          "image": "https://example.com/mughlevitheup-cuisine.jpg"
        }
      ]
    },
    {
      "name":"Assam",
        "image": [
          "https://upload.wikimedia.org/wikipedia/commons/8/83/Kamakhya_Temple.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/e/ea/Kaziranga_rhino.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/9/99/Bihu_dancers.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/c/cd/Tea_gardens_in_Assam.jpg"
        ],
        "stateMoto": "Peace, Progress and Prosperity",
        "stateSubMoto": "Gateway to the Northeast",
        "HOS": "History of States",
        "HOSImage": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Assam_British_India_1909_map.jpg",
        "History": "Assam has a unique cultural identity, shaped by the Ahom dynasty and later colonial influence. It became a part of British India in the 19th century. Post-independence, it has been central to Northeast Indian affairs, known for tea production, wildlife, and Bihu celebrations.",
        "wall": "https://img.freepik.com/free-vector/indian-ethnic-pattern-with-ornaments_107791-1584.jpg",
        "Cultures": [
        {
          "txt": "Bihu is Assam’s most celebrated folk dance and festival—performed to mark the Assamese New Year and harvest, with rhythmic steps, jaapi (umbrella) use, and traditional melodies.",
          "image": "https://example.com/assam-bihu.jpg"
        },
        {
          "txt": "Assam silk like muga and eri are treasured for their natural golden hue and resilience; weaving traditions are maintained by artisan communities.",
          "image": "https://example.com/assam-silk.jpg"
        },
        {
          "txt": "Sattriya is a classical dance-drama born in the Vaishnavite monasteries (satras) of Assam, narrating mythological stories with expressive gestures and devotional music.",
          "image": "https://example.com/assam-sattriya.jpg"
        },
        {
          "txt": "Bamboo and cane crafts include intricate weaves and decorative items like baskets, mats and traditional lamps, sourced sustainably from Assam’s forests.",
          "image": "https://example.com/assam-bamboo-craft.jpg"
        },
        {
          "txt": "Assamese thali features dishes like khar and tenga (sour curry)—balanced, local fare often served with fresh fish or greens, showcasing regional produce and flavours.",
          "image": "https://example.com/assam-thali.jpg"
        }
      ]
    },
    {
      "name":"MadhyaPradesh",
        "image": [
          "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Khajuraho_-_Kandariya_Mahadeo_Temple.jpg/1024px-Khajuraho_-_Kandariya_Mahadeo_Temple.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Sanchi_Stupa_3_and_2.jpg/1024px-Sanchi_Stupa_3_and_2.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Gwalior_Fort_Rajasthan.jpg/1024px-Gwalior_Fort_Rajasthan.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Bhimbetka_rock_art.jpg/1024px-Bhimbetka_rock_art.jpg"
        ],
        "stateMoto": "Lok Kalyan Hi Hamara Lakshya",
        "stateSubMoto": "Heart of India",
        "HOS": "History of States",
        "HOSImage": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Madhya_Pradesh_Princely_States_1909.jpg/800px-Madhya_Pradesh_Princely_States_1909.jpg",
        "History": "Madhya Pradesh, known as the 'Heart of India', has witnessed the rise and fall of several dynasties including the Mauryas, Guptas, and Mughals. The region houses some of India's oldest archaeological sites, including the Bhimbetka rock shelters dating back to the Paleolithic era. The state was home to powerful kingdoms like Malwa and Gondwana, and later became part of various Maratha territories. During British rule, it comprised several princely states including Gwalior, Indore, and Bhopal. After independence, the modern state of Madhya Pradesh was formed in 1956 through the reorganization of states. The region has been a center of Buddhist learning and culture, evidenced by the ancient Sanchi Stupa and other Buddhist monuments. The state played a significant role in India's freedom struggle, with leaders like Tatya Tope and Rani Lakshmibai fighting against British rule. Today, it stands as India's second-largest state by area, rich in mineral resources and cultural heritage.",
        "wall": "https://static.vecteezy.com/system/resources/thumbnails/008/515/322/small_2x/indian-pattern-seamless-background-free-vector.jpg",
              "Cultures": [
        {
          "txt": "Khajuraho’s temple architecture—famed for erotic and spiritual stone carvings—exemplifies Nagara style and UNESCO heritage, representing medieval sculptural excellence.",
          "image": "https://example.com/khajuraho.jpg"
        },
        {
          "txt": "Sanchi Stupa, one of the world’s oldest Buddhist monuments, dates to the 3rd century BCE and features carved toranas (gateways) bearing deep symbolism and artistry.",
          "image": "https://example.com/sanchi-stupa.jpg"
        },
        {
          "txt": "Gond art is tribal folk painting by Gond communities—using dots and vibrant colours to depict nature, deities and village life, now celebrated globally.",
          "image": "https://example.com/gond-art.jpg"
        },
        {
          "txt": "Folk music of MP includes Powada and Kabir folk traditions; regional fairs (melas) host tribal singers and dancers with percussion like mandar and manjira.",
          "image": "https://example.com/mp-folk-music.jpg"
        },
        {
          "txt": "Chanderi textiles—handwoven sarees and fabrics—combine silk and cotton with designs like buttas, stripes and gloss, representing MP’s weaving heritage.",
          "image": "https://example.com/chanderi-textiles.jpg"
        }
      ]
    },
    {
      "name":"Odisha",
        "image": [
          "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Jagannath_Temple_Puri.jpg/1024px-Jagannath_Temple_Puri.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Konark_Sun_Temple.jpg/1024px-Konark_Sun_Temple.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Lingaraj_Temple_Bhubaneswar.jpg/1024px-Lingaraj_Temple_Bhubaneswar.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Udayagiri_Khandagiri_Caves.jpg/1024px-Udayagiri_Khandagiri_Caves.jpg"
        ],
        "stateMoto": "Unity and Prosperity",
        "stateSubMoto": "Soul of India",
        "HOS": "History of States",
        "HOSImage": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Orissa_Feudatory_States_1893.jpg/800px-Orissa_Feudatory_States_1893.jpg",
        "History": "Odisha, formerly known as Orissa, boasts a glorious history spanning over 2,000 years. The region was the center of the ancient Kalinga kingdom, which gained prominence under Emperor Kharavela in the 1st century BCE. The famous Kalinga War fought by Emperor Ashoka in 261 BCE led to his conversion to Buddhism, making it a pivotal moment in Indian history. The state has been ruled by various dynasties including the Somavamshis, Eastern Gangas, and Gajapatis. The medieval period saw the construction of magnificent temples like the Jagannath Temple in Puri and the Sun Temple at Konark, showcasing the remarkable Kalinga architecture. During colonial rule, Odisha was part of the Bengal Presidency until it became a separate province in 1936, making it the first state to be formed on linguistic basis. The state played an active role in India's freedom struggle with leaders like Utkal Gourav Madhusudan Das. Post-independence, Odisha has emerged as a significant industrial state while preserving its rich cultural traditions, classical dance forms like Odissi, and religious heritage.",
        "wall": "https://static.vecteezy.com/system/resources/thumbnails/009/384/644/small_2x/indian-traditional-ornamental-seamless-pattern-free-vector.jpg",
              "Cultures": [
        {
          "txt": "Odissi, one of India’s classical dances, emerges from Odisha’s temple rituals—characterized by fluid torso movements, tribhangi stance, and expressive abhinaya.",
          "image": "https://example.com/odissi-dance.jpg"
        },
        {
          "txt": "Pattachitra is a traditional scroll painting style with mythological themes—intricate, natural-coloured works painted on cloth and dried palm leaves.",
          "image": "https://example.com/pattachitra.jpg"
        },
        {
          "txt": "Applique crafts from Pipili feature vibrantly coloured cloth designs used in temple canopies and home decoration, showcasing folk aesthetics.",
          "image": "https://example.com/pipili-applique.jpg"
        },
        {
          "txt": "Theatre-folk culture includes Gotipua dance (young boys in feminine costume)—a predecessor of Odissi—and traditional theatrical performances in rural Odisha.",
          "image": "https://example.com/gotipua.jpg"
        },
        {
          "txt": "Temple festivals like Rath Yatra in Puri unite grand chariot-pull, devotional songs, and art forms—drawing lakhs of pilgrims annually.",
          "image": "https://example.com/puri-rathyatra.jpg"
        }
      ]
    },
    {
      "name":"HimachalPradesh",
        "image": [
          "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Shimla_Christ_Church.jpg/1024px-Shimla_Christ_Church.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Rohtang_Pass_Himachal.jpg/1024px-Rohtang_Pass_Himachal.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/Hadimba_Temple_Manali.jpg/1024px-Hadimba_Temple_Manali.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Dharamshala_McLeod_Ganj.jpg/1024px-Dharamshala_McLeod_Ganj.jpg"
        ],
        "stateMoto": "Satyamev Jayate",
        "stateSubMoto": "Dev Bhoomi (Land of Gods)",
        "HOS": "History of States",
        "HOSImage": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Himachal_Pradesh_Hill_States_1947.jpg/800px-Himachal_Pradesh_Hill_States_1947.jpg",
        "History": "Himachal Pradesh, nestled in the western Himalayas, has a rich history dating back to the Vedic period when it was inhabited by the Dasas, Kolikas, and Kiradas. The region finds mention in ancient texts like the Mahabharata and Puranas. Various Rajput dynasties ruled different parts of the region, including the Katoch dynasty in Kangra, one of the oldest ruling dynasties in the world. The area witnessed invasions by Mahmud of Ghazni and later came under Mughal influence. The Gurkhas also controlled parts of the region before being defeated by the British in the early 19th century. During the British era, it comprised numerous princely states including Chamba, Mandi, Bilaspur, and Kangra. The region served as the summer capital of British India with Shimla as the seat of government. After independence, these princely states were gradually integrated, and Himachal Pradesh was formed as a union territory in 1948, becoming a full state in 1971. The state has maintained its traditional culture while developing tourism and horticulture as major economic drivers.",
        "wall": "https://static.vecteezy.com/system/resources/thumbnails/008/862/046/small_2x/mountain-seamless-pattern-hand-drawn-vintage-mountain-range-background-vector.jpg",
              "Cultures": [
        {
          "txt": "Himachali music and dance include Nati, a graceful folk dance performed in villages with circular formations during festivals and social events.",
          "image": "https://example.com/himachal-nati.jpg"
        },
        {
          "txt": "Pahari folk culture emphasizes traditional story-songs and ballads sung in mountain dialects, accompanied by instruments like the damphu and sarangi.",
          "image": "https://example.com/pahari-music.jpg"
        },
        {
          "txt": "Apple orchards are integral to hill life, with fruit‑festivals celebrating local produce and rural livelihoods, accompanied by cultural fairs.",
          "image": "https://example.com/himachal-apple-orchards.jpg"
        },
        {
          "txt": "Woollen handicrafts like shawls, caps and carpets are handwoven in Himachal—tradition passed through communities, often using natural dyes.",
          "image": "https://example.com/himachal-wool-crafts.jpg"
        },
        {
          "txt": "Buddhist monasteries, especially in Dharamshala and Lahaul‑Spiti, are hubs of Tibetan art, prayer flags, thangka painting, and monastic festivals.",
          "image": "https://example.com/himachal-monastery.jpg"
        }
      ]
    },
    {
      "name":"Goa",
        "image": [
          "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/Basilica_of_Bom_Jesus_Goa.jpg/1024px-Basilica_of_Bom_Jesus_Goa.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Arambol_Beach_Goa.jpg/1024px-Arambol_Beach_Goa.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Se_Cathedral_Old_Goa.jpg/1024px-Se_Cathedral_Old_Goa.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Fort_Aguada_Goa.jpg/1024px-Fort_Aguada_Goa.jpg"
        ],
        "stateMoto": "Sarve Bhavantu Sukhinah",
        "stateSubMoto": "Pearl of the Orient",
        "HOS": "History of States",
        "HOSImage": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Portuguese_India_1630.jpg/800px-Portuguese_India_1630.jpg",
        "History": "Goa's history is marked by diverse cultural influences spanning over 2,000 years. Originally inhabited by the Konkani people, the region was ruled by the Kadamba dynasty from the 4th to 14th centuries, followed by the Bahmani Sultanate and later the Adil Shahi dynasty of Bijapur. The Portuguese arrived in 1510 under Afonso de Albuquerque, establishing Goa as the capital of Portuguese India. For over 450 years, Portuguese rule left an indelible mark on Goan culture, architecture, cuisine, and religion. The region became a major center for spice trade and Christian missionary activities. The Portuguese introduced Christianity, European architectural styles, and new crops like cashew and coconut. Despite several attempts by Maratha and Mysore rulers to capture Goa, Portuguese control remained strong. The Indian government finally liberated Goa in 1961 through Operation Vijay, ending centuries of colonial rule. Initially a union territory along with Daman and Diu, Goa achieved full statehood in 1987. Today, it's India's smallest state by area and fourth smallest by population, renowned for its beaches, Portuguese colonial architecture, and unique Indo-Portuguese culture.",
        "wall": "https://static.vecteezy.com/system/resources/thumbnails/008/137/991/small_2x/tropical-seamless-pattern-with-palm-leaves-free-vector.jpg",
        "Cultures": [
        {
          "txt": "Konkani culture blends Hindu and Catholic traditions—visible in village feasts, folk songs (kantigals), and community celebrations in many languages.",
          "image": "https://example.com/goa-konkani-culture.jpg"
        },
        {
          "txt": "Portuguese colonial architecture is seen in heritage churches (e.g., Basilica of Bom Jesus), colorful houses and tiled roofs, reflecting centuries of influence.",
          "image": "https://example.com/goa-portuguese-architecture.jpg"
        },
        {
          "txt": "Carnival features parades, floats, samba troupes and masquerades—a legacy of Portuguese Brazil—held in streets before Lent, blending fun and tradition.",
          "image": "https://example.com/goa-carnival.jpg"
        },
        {
          "txt": "Fado music is performed in intimate venues; these melodic, melancholic Portuguese songs echo across Goan heritage music scenes.",
          "image": "https://example.com/goa-fado.jpg"
        },
        {
          "txt": "Seafood cuisine—Goan fish curry, vindaloo, xacuti—blends coconut, tamarind and spices, reflecting coastal life and Portuguese‑Indian fusion; cashews and sol kadi are staples.",
          "image": "https://example.com/goa-cuisine.jpg"
        }
      ]
    },
    {
      "name":"Haryana",
        "image": [
          "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Kurukshetra_Panorama_Science_Museum.jpg/1024px-Kurukshetra_Panorama_Science_Museum.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Pinjore_Gardens_Haryana.jpg/1024px-Pinjore_Gardens_Haryana.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Sultanpur_Bird_Sanctuary.jpg/1024px-Sultanpur_Bird_Sanctuary.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Panipat_Museum.jpg/1024px-Panipat_Museum.jpg"
        ],
        "stateMoto": "Satyamev Jayate",
        "stateSubMoto": "Land of Rotis",
        "HOS": "History of States",
        "HOSImage": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Punjab_1947_Partition.jpg/800px-Punjab_1947_Partition.jpg",
        "History": "Haryana, carved out of Punjab in 1966, has a history deeply rooted in ancient Indian civilization. The region is considered sacred in Hindu tradition as it encompasses Kurukshetra, the legendary battlefield of the Mahabharata where Lord Krishna delivered the Bhagavad Gita. Archaeological evidence suggests the area was part of the Indus Valley Civilization, with sites like Rakhigarhi being one of the largest Harappan settlements. The region witnessed the rise and fall of various empires including the Mauryas, Guptas, and Delhi Sultanate. Panipat, located in Haryana, was the site of three historic battles that shaped Indian history - particularly the battles of 1526, 1556, and 1761. During the Mughal period, the region was strategically important as it lay on the route between Delhi and Punjab. The area later came under Maratha influence before being incorporated into the Sikh Empire. Post-independence, when Punjab was reorganized on linguistic lines, Haryana emerged as a separate Hindi-speaking state. The state has since transformed from a predominantly agricultural region to an industrial and technological hub, contributing significantly to the national economy while maintaining its cultural heritage and traditional values.",
        "wall": "https://static.vecteezy.com/system/resources/thumbnails/008/476/842/small_2x/indian-paisley-pattern-seamless-background-free-vector.jpg",
        "Cultures": [
          {
            "txt": "Haryanvi folk music features instruments like been, sarangi, and dholak—songs narrate valor, romance, and rural life through traditional ballads.",
            "image": "https://static.langimg.com/thumb/msid-71753661,imgsize-107136,width-700,height-525,resizemode-75/71753661.jpg"
          },
          {
            "txt": "Saang theatre is a traditional folk drama combining music, dance, and dialogue to depict mythological and moral stories across Haryana's villages.",
            "image": "https://haryana.pscnotes.com/wp-content/uploads/2020/11/saang.jpg"
          },
          {
            "txt": "Kushti (traditional wrestling) is a popular rural sport with local akharas (wrestling arenas) fostering discipline and strength among youth.",
            "image": "https://www.mapsofindia.com/maps/haryana/culture/wrestling.jpg"
          },
          {
            "txt": "Haryanvi cuisine includes bajra roti, churma, kachri sabzi, and lassi—reflecting a robust rural food culture rooted in farming traditions.",
            "image": "https://www.holidify.com/images/cmsuploads/compressed/2716_20190110165843.jpg"
          },
          {
            "txt": "Festivals like Teej and Karva Chauth are celebrated with vibrant rituals, mehndi, songs, and traditional attire by women across Haryana.",
            "image": "https://assets.telegraphindia.com/telegraph/2022/Sep/1663161063_t.jpg"
          }
        ]
    },
    {
      "name":"Jharkhand",
        "image": [
          "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Hundru_Falls_Jharkhand.jpg/1024px-Hundru_Falls_Jharkhand.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Parasnath_Hill_Jharkhand.jpg/1024px-Parasnath_Hill_Jharkhand.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Deoghar_Baidyanath_Temple.jpg/1024px-Deoghar_Baidyanath_Temple.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Betla_National_Park.jpg/1024px-Betla_National_Park.jpg"
        ],
        "stateMoto": "Tejaswi Aur Vayavasayi",
        "stateSubMoto": "Land of Forests",
        "HOS": "History of States",
        "HOSImage": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Jharkhand_Tribal_Map.jpg/800px-Jharkhand_Tribal_Map.jpg",
        "History": "Jharkhand, meaning 'Land of Forests', was carved out of Bihar in 2000 to become India's 28th state. The region has a rich tribal heritage with indigenous communities like the Santhals, Mundas, and Oraons inhabiting the area for centuries. Archaeological evidence suggests human habitation dating back to the Mesolithic period. The area was historically known as Jharkhand or Chotanagpur, referenced in ancient texts including the Mahabharata. Various dynasties ruled the region including the Mauryas, Guptas, and later the Mughals, though many tribal kingdoms maintained their autonomy. The British colonial administration established control over the region in the 19th century, leading to several tribal uprisings including the famous Santhal Rebellion of 1855 and the Birsa Munda movement in the 1890s. Birsa Munda, revered as 'Bhagwan Birsa', led a significant movement against British colonial rule and exploitation of tribal lands. The region's rich mineral deposits, including coal, iron ore, and mica, attracted industrial development during the colonial period. Post-independence, the demand for a separate state grew due to tribal identity and resource exploitation concerns. The state's formation in 2000 was aimed at preserving tribal culture and ensuring better governance of the resource-rich region.",
        "wall": "https://static.vecteezy.com/system/resources/thumbnails/008/853/987/small_2x/tribal-seamless-pattern-with-geometric-shapes-free-vector.jpg",
        "Cultures": [
        {
          "txt": "Santhali dance and music, featuring drums like madal and instruments like tiriyo, are integral to tribal festivals and social celebrations.",
          "image": "https://cdn.downtoearth.org.in/library/large/2022-08-08/0.50417300_1659962356_santhali.jpg"
        },
        {
          "txt": "Sohrai art involves mural painting with natural colors on walls, depicting animals and tribal life during harvest celebrations.",
          "image": "https://i0.wp.com/www.tribalzone.net/wp-content/uploads/2022/01/Sohrai_Art.jpg"
        },
        {
          "txt": "The Sarna religion honors nature spirits—tribes worship sacred groves and celebrate with offerings, dances, and communal rituals.",
          "image": "https://images.indianexpress.com/2020/11/tribal_1200_getty.jpg"
        },
        {
          "txt": "Tribal cuisines include dishes like bamboo shoot curry, rice beer (handia), mahua, and roasted silkworms, rooted in forest resources.",
          "image": "https://static.langimg.com/thumb/msid-80231544,width-680,resizemode-4/80231544.jpg"
        },
        {
          "txt": "Festivals like Karam and Tusu Parab feature tribal rituals, drumming, and songs passed down through oral traditions.",
          "image": "https://i.ytimg.com/vi/nqlG7yNDyJY/maxresdefault.jpg"
        }
      ]
      },
    {
      "name":"Uttarakhand",
        "image": [
          "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/Kedarnath_Temple_Uttarakhand.jpg/1024px-Kedarnath_Temple_Uttarakhand.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Nanda_Devi_Peak.jpg/1024px-Nanda_Devi_Peak.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Rishikesh_Ganga_Aarti.jpg/1024px-Rishikesh_Ganga_Aarti.jpg",
          "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/Valley_of_Flowers_Uttarakhand.jpg/1024px-Valley_of_Flowers_Uttarakhand.jpg"
        ],
        "stateMoto": "Satyamev Jayate",
        "stateSubMoto": "Devbhoomi (Land of Gods)",
        "HOS": "History of States",
        "HOSImage": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/Uttarakhand_Hill_States_1815.jpg/800px-Uttarakhand_Hill_States_1815.jpg",
        "History": "Uttarakhand, formerly known as Uttaranchal, was carved out of Uttar Pradesh in 2000 to become India's 27th state. The region, known as Devbhoomi or 'Land of Gods', has immense religious and cultural significance in Hindu tradition. Ancient texts like the Skanda Purana and Mahabharata mention the region as Kedarkhand and Manaskhand. The area has been inhabited since prehistoric times, with evidence of human settlement dating back to the Stone Age. The region was ruled by various dynasties including the Kunindas, Pauravas, and later the Katyuri dynasty which established the first major kingdom in the 7th century. The Chand dynasty ruled Kumaon while the Panwar dynasty controlled Garhwal for several centuries. The region faced invasions from various rulers including the Rohillas and later the British. The British established control in the early 19th century after the Anglo-Nepalese War. The state played a significant role in the independence movement with leaders like Govind Ballabh Pant. The Chipko movement, an environmental conservation movement led by Sunderlal Bahuguna, originated here in the 1970s. The formation of Uttarakhand was driven by the unique geographical, cultural, and administrative needs of the hill regions, distinct from the plains of Uttar Pradesh.",
        "wall": "https://static.vecteezy.com/system/resources/thumbnails/008/862/046/small_2x/mountain-seamless-pattern-hand-drawn-vintage-mountain-range-background-vector.jpg",
        "Cultures": [
          {
            "txt": "Garhwali and Kumaoni folk songs and dances like Langvir Nritya express devotion, nature, and hill community stories.",
            "image": "https://www.holidify.com/images/cmsuploads/compressed/1135_20190228134938.jpg"
          },
          {
            "txt": "Char Dham Yatra to Kedarnath, Badrinath, Gangotri, and Yamunotri is central to Hindu pilgrimage culture in Uttarakhand.",
            "image": "https://www.savaari.com/blog/wp-content/uploads/2021/09/kedarnath-1.jpg"
          },
          {
            "txt": "Hill cuisine features mandua roti, chainsoo, jhangora kheer, and local lentils—sustaining mountain life with simple, hearty food.",
            "image": "https://img.onmanorama.com/content/dam/mm/en/travel/travel-news/images/2022/10/1/garhwali-cuisine.jpg"
          },
          {
            "txt": "Wood carving and copper crafts from the region showcase intricate temple motifs and utilitarian tools used by villagers.",
            "image": "https://i.pinimg.com/originals/18/88/fc/1888fc4993ec1cc16eb7a73b48dc95d6.jpg"
          },
          {
            "txt": "Chipko Movement of the 1970s began here as an eco-conservation protest where villagers, especially women, hugged trees to save forests.",
            "image": "https://static.theprint.in/wp-content/uploads/2022/06/Feature_Image-Chipko_Movement.png"
          }
        ]
   },
    {
  "name": "Delhi",
  "image": [
    "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/India_Gate_in_New_Delhi_03-2016_img3.jpg/1024px-India_Gate_in_New_Delhi_03-2016_img3.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Qutub_Minar.jpg/1024px-Qutub_Minar.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Red_Fort_%28Lal_Qila%29_in_Delhi.jpg/1024px-Red_Fort_%28Lal_Qila%29_in_Delhi.jpg"
  ],
  "stateMoto": "Satyamev Jayate",
  "stateSubMoto": "Dilwalon ki Dilli",
  "HOS": "History of Delhi",
  "HOSImage": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/Old_Delhi_in_1857.jpg/800px-Old_Delhi_in_1857.jpg",
  "History": "Delhi, the capital of India, has been a cultural, political, and historical hub for centuries. It has seen the rise and fall of several empires including the Mughals and the British. The city is home to historic landmarks like the Red Fort, India Gate, and Qutub Minar. Post-independence, Delhi evolved as the political nerve center of India and is now a bustling metropolis blending heritage and modernity.",
  "wall": "https://images.unsplash.com/photo-1586015556464-1be8ce730ed4?auto=format&fit=crop&w=800&q=60",
  "Cultures": [
  {
    "txt": "Delhi blends Mughal, Punjabi, and cosmopolitan influences—Qawwali at Nizamuddin Dargah and street music shape its vibrant soul.",
    "image": "https://cdn.dnaindia.com/sites/default/files/styles/full/public/2019/08/14/861844-nizamuddin-dargah-qawwali.jpg"
  },
  {
    "txt": "Mughlai cuisine includes kebabs, biryani, nihari, and parathas—served in old Delhi eateries and street food stalls.",
    "image": "https://images.herzindagi.info/image/2023/Sep/mughlai-food.jpg"
  },
  {
    "txt": "Dilli Haat showcases India's diverse crafts—from Madhubani to Phulkari—alongside food and music from various states.",
    "image": "https://i.pinimg.com/originals/ae/53/b6/ae53b68e6d4577c1f0ae1b0a41010e2d.jpg"
  },
  {
    "txt": "Festivals like Diwali, Eid, Holi, and Christmas are celebrated with cultural harmony and colorful public events.",
    "image": "https://images.indianexpress.com/2019/10/delhi-diwali-759.jpg"
  },
  {
    "txt": "Historical walks in Shahjahanabad, Lutyens’ Delhi, and Chandni Chowk blend colonial, Mughal, and modern urban narratives.",
    "image": "https://delhitourism.gov.in/delhitourism/upload/places/chandni_chowk.jpg"
  }
]
},
{
  "name": "Jammu & Kashmir",
  "image": [
    "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Dal_Lake_Srinagar.jpg/1024px-Dal_Lake_Srinagar.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Shankaracharya_Temple.jpg/1024px-Shankaracharya_Temple.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Mughal_Garden.jpg/1024px-Mughal_Garden.jpg"
  ],
  "stateMoto": "Naya Kashmir",
  "stateSubMoto": "Paradise on Earth",
  "HOS": "History of Jammu & Kashmir",
  "HOSImage": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Maharaja_Hari_Singh.jpg/800px-Maharaja_Hari_Singh.jpg",
  "History": "Jammu & Kashmir, historically a princely state, acceded to India in 1947 under contentious conditions. The region has been a center of Hindu, Buddhist, and Muslim civilizations. The Kashmir valley has faced political and security issues post-independence. In 2019, Article 370 was abrogated, restructuring it into two Union Territories: Jammu & Kashmir and Ladakh. The region remains geopolitically significant and culturally rich.",
  "wall": "https://wallpapercave.com/wp/wp2916567.jpg",
  "Cultures": [
  {
    "txt": "Wazwan, a multi-course Kashmiri feast, includes dishes like Rogan Josh, Gustaba, and Yakhni—served on a traditional trami.",
    "image": "https://static.toiimg.com/photo/68535573.cms"
  },
  {
    "txt": "Kashmiri handicrafts include pashmina shawls, papier-mâché, and hand-knotted carpets—symbolizing fine artistic traditions.",
    "image": "https://www.holidify.com/images/cmsuploads/compressed/Pashmina_20200227170242.jpg"
  },
  {
    "txt": "Dogra and Kashmiri folk dances like Rouf and Dumhal are performed during harvests and weddings, often by women in phiran dresses.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/Traditional_Kashmiri_Folk_Dance.jpg/1024px-Traditional_Kashmiri_Folk_Dance.jpg"
  },
  {
    "txt": "Amarnath and Vaishno Devi pilgrimages attract millions, reflecting the region’s deep spiritual roots and high-altitude devotion.",
    "image": "https://static.abplive.com/wp-content/uploads/2022/06/29140411/amarnath-yatra.jpg"
  },
  {
    "txt": "Sufi music and mystic poetry (Kalam-e-Khusro) remain central to the valley's syncretic cultural identity.",
    "image": "https://images.hindustantimes.com/img/2021/03/14/1600x900/Khushwant_Singh_Lit_fest_1615703721945_1615703748703.jpg"
  }
]
},
{
  "name": "Ladakh",
  "image": [
    "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Pangong_Tso_Lake_Ladakh.jpg/1024px-Pangong_Tso_Lake_Ladakh.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Hemis_Monastery.jpg/1024px-Hemis_Monastery.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Leh_Palace.jpg/1024px-Leh_Palace.jpg"
  ],
  "stateMoto": "Unity, Peace, Progress",
  "stateSubMoto": "Land of High Passes",
  "HOS": "History of Ladakh",
  "HOSImage": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Map_of_Ladakh_1890s.jpg/800px-Map_of_Ladakh_1890s.jpg",
  "History": "Ladakh, part of the erstwhile state of Jammu & Kashmir, became a Union Territory in 2019. It has historical ties with Tibetan culture and was part of the Silk Route. Known for its Buddhist monasteries and strategic importance, Ladakh has a unique identity influenced by Tibetan, Balti, and Indian civilizations. The region is also a frontier for Indian defense and eco-tourism.",
  "wall": "https://cdn.pixabay.com/photo/2018/04/14/22/18/leh-3318304_1280.jpg",
  "Cultures": [
  {
    "txt": "Buddhist monasteries like Hemis and Thiksey hold ritual Cham dances, prayers, and Thangka painting festivals.",
    "image": "https://www.transindiatravels.com/wp-content/uploads/hemis-monastery.jpg"
  },
  {
    "txt": "Ladakhi cuisine includes momos, thukpa, skyu, and butter tea—warming foods suited for high-altitude cold deserts.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Thukpa.jpg/800px-Thukpa.jpg"
  },
  {
    "txt": "Pashmina weaving is a key livelihood—fine cashmere wool is spun into warm, luxurious shawls and stoles.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/0/01/Pashmina_Shopping.jpg"
  },
  {
    "txt": "Festivals like Losar and Ladakh Festival showcase mask dances, music, and archery reflecting Tibetan heritage.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Losar_Celebration.jpg"
  },
  {
    "txt": "Mudbrick architecture with prayer flags and stupas define village life surrounded by barren mountains and monasteries.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/9/93/Spituk_Monastery%2C_Ladakh.jpg"
  }
]
},
{
  "name": "Telangana",
  "image": [
    "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Charminar_Hyderabad.jpg/1024px-Charminar_Hyderabad.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Bhongir_Fort.jpg/1024px-Bhongir_Fort.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Ramappa_Temple.jpg/1024px-Ramappa_Temple.jpg"
  ],
  "stateMoto": "Satyamev Jayate",
  "stateSubMoto": "Jai Telangana",
  "HOS": "History of Telangana",
  "HOSImage": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Nizam_of_Hyderabad.jpg/800px-Nizam_of_Hyderabad.jpg",
  "History": "Telangana, India's 29th state, was formed in 2014 after decades of demand for separation from Andhra Pradesh. Historically part of the Hyderabad princely state under the Nizams, the region has a distinct cultural and political identity. It played a key role in the Deccan's history through Satavahana, Kakatiya, and Qutb Shahi dynasties. Hyderabad, the capital, is a hub of IT, heritage, and innovation.",
  "wall": "https://images.unsplash.com/photo-1610478828524-6a7ff0f0cc03?auto=format&fit=crop&w=800&q=60",
  "Cultures": [
  {
    "txt": "Bathukamma festival is a floral celebration by women with intricate flower arrangements, songs, and community rituals.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Bathukamma_festival_in_Telangana.jpg/800px-Bathukamma_festival_in_Telangana.jpg"
  },
  {
    "txt": "Hyderabadi cuisine blends Mughal and Telugu flavors—biryani, haleem, and kebabs are iconic dishes.",
    "image": "https://www.archanaskitchen.com/images/archanaskitchen/1-Author/Karthika_Gopalakrishnan/Hyderabadi_Dum_Biryani.jpg"
  },
  {
    "txt": "Bidri art from Hyderabad features metal inlay work with silver on blackened alloys, reflecting Persian influences.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Bidriware_Hyderabad.jpg/800px-Bidriware_Hyderabad.jpg"
  },
  {
    "txt": "Bonalu is a regional folk festival honoring the goddess Mahakali, with colorful processions, drumming, and rituals.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/2/22/Bonalu_Hyderabad.jpg"
  },
  {
    "txt": "Dakhni Urdu and Qutb Shahi architecture represent Telangana’s unique Deccan cultural and linguistic heritage.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Qutb_Shahi_Tombs.jpg"
  }
]
},
{
  "name": "Arunachal Pradesh",
  "image": [
    "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Tawang_Monastery.jpg/1024px-Tawang_Monastery.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Ziro_Valley.jpg/1024px-Ziro_Valley.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Sela_Pass.jpg/1024px-Sela_Pass.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Namdapha_National_Park.jpg/1024px-Namdapha_National_Park.jpg"
  ],
  "stateMoto": "Satyameva Jayate",
  "stateSubMoto": "Land of the Dawn-Lit Mountains",
  "HOS": "History of State",
  "HOSImage": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/India_Arunachal_Pradesh_location_map.svg/800px-India_Arunachal_Pradesh_location_map.svg.png",
  "History": "Arunachal Pradesh, meaning 'Land of the Dawn-Lit Mountains', shares international borders with Bhutan, China, and Myanmar. It was part of Assam until 1972, when it became a Union Territory. It achieved full statehood on February 20, 1987. The state is historically linked to the ancient tribal and Tibetan traditions. Tawang, one of its key regions, is culturally Tibetan and home to the Tawang Monastery. Arunachal is also historically mentioned in the Kalika Purana and Mahabharata. It has seen disputes with China, especially over the McMahon Line. The region has numerous tribes with rich traditions, languages, and customs.",
  "wall": "https://img.freepik.com/premium-vector/tribal-ethnic-seamless-pattern_1017-42492.jpg",
  "Cultures": "Home to 26 major tribes and over 100 sub-tribes, known for festivals like Losar, Dree, and Nyokum. Bamboo crafts, tribal dances, and traditional music dominate cultural life."
}
]
